---
type: DuctLining
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 2
tags: [revit-api, class]
---

# DuctLining

`Autodesk.Revit.DB.Mechanical.DuctLining` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static DuctLining Create ( Document document , ElementId ductOrContentElementId , ElementId ductLiningTypeId , double Thickness )` |
| Property | Parameter | — | `` |